kylemanna/kinetis-sdk2/middleware/sdmmc_2.1.1/src/fsl_mmc.c
    /* XOR the send pattern and receive pattern */
    if (((sendPattern[0U] ^ receivedPattern[0U]) & xorMask) != xorResult)
    {
        return kStatus_Fail;
    }

    return kStatus_Success;
}

static status_t MMC_SetDataBusWidth(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card);

    uint8_t powerClass;
    mmc_extended_csd_config_t extendedCsdconfig;

    /* Set power class corresponding to bus width. From the Extended CSD the host can learn the power class of the card
    and choose to work with a wider data bus. */
    powerClass = MMC_GetPowerClass(card, width);
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex = kMMC_ExtendedCsdIndexPowerClass;
    extendedCsdconfig.ByteValue = powerClass;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    /* Set data bus width */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex = kMMC_ExtendedCsdIndexBusWidth;
    extendedCsdconfig.ByteValue = width;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    return kStatus_Success;
}

static void MMC_SetMaxDataBusWidth(mmc_card_t *card)
{
    assert(card);

    status_t error = kStatus_Fail;

    /* Test and set the data bus width for card. */
    if (card->host.capability.flags & kSDHC_Support8BitFlag)
    {
        SDHC_SetDataBusWidth(card->host.base, kSDHC_DataBusWidth8Bit);
        if ((kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth8bit)) &&
            (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth8bit)))
        {
            error = kStatus_Success;
        }
    }
    if ((error == kStatus_Fail) && (card->host.capability.flags & kSDHC_Support4BitFlag))
    {
        SDHC_SetDataBusWidth(card->host.base, kSDHC_DataBusWidth4Bit);
        if ((kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth4bit)) &&
            (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth4bit)))
        {
            error = kStatus_Success;
        }
    }

    if (error == kStatus_Fail)
    {
        /* Card's data bus width will be default 1 bit mode. */
        SDHC_SetDataBusWidth(card->host.base, kSDHC_DataBusWidth1Bit);
    }
}

static status_t MMC_SwitchHighSpeed(mmc_card_t *card)
{
    assert(card);

    mmc_extended_csd_config_t extendedCsdconfig;

    /* Switch to high speed timing. */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex = kMMC_ExtendedCsdIndexHighSpeedTiming;
    extendedCsdconfig.ByteValue = kMMC_HighSpeedTiming;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    /* Switch to corresponding frequency in high speed mode. */
    if ((card->flags & kMMC_SupportHighSpeed52MHZFlag))
    {
        card->busClock_Hz = SDHC_SetSdClock(card->host.base, card->host.sourceClock_Hz, MMC_CLOCK_52MHZ);
    }
    else
    {
        card->busClock_Hz = SDHC_SetSdClock(card->host.base, card->host.sourceClock_Hz, MMC_CLOCK_26MHZ);
    }

    return kStatus_Success;
}

static void MMC_DecodeCid(mmc_card_t *card, uint32_t *rawCid)
{
    assert(card);
    assert(rawCid);

    mmc_cid_t *cid;

    cid = &(card->cid);
    cid->manufacturerID = (uint8_t)((rawCid[3U] & 0xFF000000U) >> 24U);
    cid->applicationID = (uint16_t)((rawCid[3U] & 0xFFFF00U) >> 8U);

    cid->productName[0U] = (uint8_t)((rawCid[3U] & 0xFFU));
    cid->productName[1U] = (uint8_t)((rawCid[2U] & 0xFF000000U) >> 24U);
    cid->productName[2U] = (uint8_t)((rawCid[2U] & 0xFF0000U) >> 16U);
    cid->productName[3U] = (uint8_t)((rawCid[2U] & 0xFF00U) >> 8U);
    cid->productName[4U] = (uint8_t)((rawCid[2U] & 0xFFU));

    cid->productVersion = (uint8_t)((rawCid[1U] & 0xFF000000U) >> 24U);

    cid->productSerialNumber = (uint32_t)((rawCid[1U] & 0xFFFFFFU) << 8U);
    cid->productSerialNumber |= (uint32_t)((rawCid[0U] & 0xFF000000U) >> 24U);

    cid->manufacturerData = (uint16_t)((rawCid[0U] & 0xFFF00U) >> 8U);
}

static status_t MMC_AllSendCid(mmc_card_t *card)
{
    assert(card);
    assert(card->host.transfer);

    sdhc_transfer_t content = {0};
    sdhc_command_t command = {0};

    command.index = kSDMMC_AllSendCid;
    command.argument = 0U;
    command.responseType = kSDHC_ResponseTypeR2;

    content.command = &command;
    content.data = NULL;
    if (kStatus_Success == card->host.transfer(card->host.base, &content))
    {
        memcpy(card->rawCid, command.response, sizeof(card->rawCid));
        MMC_DecodeCid(card, command.response);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_SendCsd(mmc_card_t *card)
{
    assert(card);
    assert(card->host.transfer);

    sdhc_command_t command = {0};
    sdhc_transfer_t content = {0};

    command.index = kSDMMC_SendCsd;
    command.argument = (card->relativeAddress << 16U);
    command.responseType = kSDHC_ResponseTypeR2;

    content.command = &command;
    content.data = 0U;
    if (kStatus_Success == card->host.transfer(card->host.base, &content))
    {
        memcpy(card->rawCsd, command.response, sizeof(card->rawCsd));
        /* The response is from bit 127:8 in R2, corresponding to command.response[3][31:0] to
        command.response[0U][31:8]. */
        MMC_DecodeCsd(card, card->rawCsd);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_CheckBlockRange(mmc_card_t *card, uint32_t startBlock, uint32_t blockCount)
{
    assert(card);
    assert(blockCount);

    status_t error = kStatus_Success;
    uint32_t partitionBlocks;

